IRP/src/InformationRegisters/T9013S_AccountsTax/T9013S_AccountsTax.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T9013S_AccountsTax</name>
 <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
 <resources>
  <name>IncomingAccount</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <resources>
  <name>OutgoingAccount</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <resources>
  <name>IncomingAccountReturn</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <resources>
  <name>OutgoingAccountReturn</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LedgerTypeVariant</name>
  <type>
   <types>CatalogRef.LedgerTypeVariants</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Tax</name>
  <type>
   <types>CatalogRef.Taxes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>VatRate</name>
  <type>
   <types>CatalogRef.TaxRates</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/T9013S_AccountsTax/RecordSetModule.bsl
Procedure OnWrite(Cancel, Replacing)
	If DataExchange.Load Then
		Return;
	EndIf;
	RefreshReusableValues();
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	For Each Record In ThisObject Do
		If ValueIsFilled(Record.IncomingAccount) And Record.IncomingAccount.NotUsedForRecords Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().AccountingError_01, Record.IncomingAccount.Code), "IncomingAccount", ThisObject);
		EndIf;
		
		If ValueIsFilled(Record.IncomingAccountReturn) And Record.IncomingAccountReturn.NotUsedForRecords Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().AccountingError_01, Record.IncomingAccountReturn.Code), "IncomingAccountReturn", ThisObject);
		EndIf;
		
		If ValueIsFilled(Record.OutgoingAccount) And Record.OutgoingAccount.NotUsedForRecords Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().AccountingError_01, Record.OutgoingAccount.Code), "OutgoingAccount", ThisObject);
		EndIf;
		
		If ValueIsFilled(Record.OutgoingAccountReturn) And Record.OutgoingAccountReturn.NotUsedForRecords Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().AccountingError_01, Record.OutgoingAccountReturn.Code), "OutgoingAccountReturn", ThisObject);
		EndIf;
	EndDo;
EndProcedure
